---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.IfcProjectGuid
source: html/d633a7f3-92bb-5a78-17f8-1feb9653ddd0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.IfcProjectGuid Property

"IfcProject GUID"

## Syntax (C#)
```csharp
public static ForgeTypeId IfcProjectGuid { get; }
```